package main.java.com.vasha.lims.model;

public class Magazine {
}
// теперь, для разнообразия я бы дописал еще класс magazine, чтобы сделать осмысленной именно такую реализацию у LibraryItem.
// в общем я сделаю его по аналогии с book, думаю можно добавить Тип доступа: традиционные печатные номера, архивные подшивки,
// открытый (Open Access) или платный электронный доступ. Периодичность: ежедневные, еженедельные, ежемесячные, ежеквартальные и т.д..
// целевое назначение (научный, производственный, научно-популярный)